In [1]:
import pandas as pd
df = pd.read_excel('score.xlsx',index_col='지원번호')
df.sort_index(ascending=True,inplace=True)

### groupby-그룹화

In [3]:
# 구로고, 단지고 
df.groupby('학교')

In [4]:
df.groupby('학교').get_group('구로고')

       이름   학교    키  국어  영어   수학  과학  사회        SW특기
지원번호
1번    강나래  구로고  197  90  85  100  95  85      Python
2번    강태원  구로고  184  40  35   50  55  25        Java
3번    강호림  구로고  168  80  75   70  80  75  javascript
4번    김수진  구로고  187  40  60   70  75  80         NaN
5번    김재욱  구로고  188  15  20   10  35  10         NaN

In [5]:
df.groupby("학교").get_group("단지고")

       이름   학교    키   국어   영어  수학  과학  사회    SW특기
지원번호
6번    박동현  단지고  202   80  100  95  85  80       C
7번    박혜정  단지고  188   55   65  45  40  35  PYTHON
8번    승근열  단지고  190  100   85  90  95  95      c#

In [6]:
# 각 학교에 있는 학생수
df.groupby('학교').size()

학교
구로고    5
단지고    3
dtype: int64

In [7]:
list(df.groupby('학교').size())

[5, 3]

In [9]:
df.groupby("학교").size()['구로고']
df.groupby("학교").size()['단지고']

3

In [11]:
df['키'].mean()

188.0

In [10]:
df.groupby('학교')['키'].mean()

학교
구로고    184.800000
단지고    193.333333
Name: 키, dtype: float64

In [12]:
df.groupby('학교')[['키','국어','영어','수학','과학','사회']].mean()

              키         국어         영어         수학         과학    사회
학교
구로고  184.800000  53.000000  55.000000  60.000000  68.000000  55.0
단지고  193.333333  78.333333  83.333333  76.666667  73.333333  70.0

In [13]:
df.groupby('학교')[['키','국어','영어','수학','과학','사회']].sum()

       키   국어   영어   수학   과학   사회
학교
구로고  924  265  275  300  340  275
단지고  580  235  250  230  220  210

In [14]:
df.groupby('학교')[['키','국어','영어','수학','과학','사회']].max()

       키   국어   영어   수학  과학  사회
학교
구로고  197   90   85  100  95  85
단지고  202  100  100   95  95  95

In [15]:
df['학년'] =[3,3,2,1,1,3,2,2]

In [19]:
cols = list(df.columns)
df = df[cols[0:2]+[cols[-1]]+cols[2:-1]]

In [23]:
df
# 파일저장
df.to_csv('score.csv',encoding='utf-8')

In [24]:
df.to_csv('score.txt',encoding='utf-8')

In [26]:
df.to_excel('score.xlsx')